# 1. opt_inquiry _\# 0_The inquiry for selection
# 2. opt_1 _\# First option
# 3. opt_2 _\# Second option
# 4. opt_3 _\# Third option


dict_options_logging = \
    {
        0 : "\nДоброго времени суток! Можете зайти в программу под своим логином [1] или Создать новую учетную запись [2]: " ,
        1 : "Зайти под своим логином.\n" ,
        2 : "Созание новой учетной записи.\n",
    }

dict_options_user = \
    {
        0 : "\nС чем хотите поработать? Списки дел [1],  Рецепты [2] или Списки покупок [3]: " ,
        1 : "Работа со списками дел.\n" ,
        2 : "Работа с рецептами.\n",
        3 : "Работа со списками покупок.\n"
    }

dict_start_deals = \
    {
        0 : "Будете создавать новую задачу или искать уже созданную? Создать [1],  Поиск задачи для просмотра/изменения/удаления [2]: " ,
        1 : "Создать новый список дел.\n" ,
        2 : "Найти уже созданный список дел.\n",
    }

dict_options_deals = \
    {
        0 : "Искомый список найден. Что требуется сделать? Посмотреть [1], Редактировать [2] или Удалить [3]: " ,
        1 : "Просмотр списка дел.\n" ,
        2 : "Редактирование списка дел.\n",
        3 : "Удаление списка дел.\n"
    }

dict_start_receipt = \
    {
        0 : "Нашли новый рецепт или будете готовить? Создать новый рецепт [1] или Поиск рецепта для просмотра/изменения/удаления [2]: " ,
        1 : "Создать новый рецепт.\n" ,
        2 : "Найти уже созданный рецепт.\n",
    }

dict_options_receipt = \
    {
        0 : "Искомый рецепт найден. Что требуется сделать? Посмотреть [1], Редактировать [2] или Удалить [3]: " ,
        1 : "Просмотр рецепта.\n" ,
        2 : "Редактирование рецепта.\n",
        3 : "Удаление рецепта.\n"
    }

dict_start_shopping_list = \
    {
        0 : "Будете создавать новый список покупок или искать уже созданный? Создать [1],  Поиск списка покупок для просмотра/изменения/удаления [2]: " ,
        1 : "Создать новый список покупок.\n" ,
        2 : "Найти уже созданный список покупок.\n",
    }

dict_options_shopping_list = \
    {
        0 : "Искомый список найден. Что требуется сделать? Посмотреть [1], Редактировать [2] или Удалить [3]: " ,
        1 : "Просмотр списка покупок.\n" ,
        2 : "Редактирование списка покупок.\n",
        3 : "Удаление списка покупок.\n"
    }

dict_options_admin = \
    {
        0 : "\nПривет, админ! С чем хочешь поработать? База записей [1] или Файл лога [2]: " ,
        1 : "Работа с базой записей.\n" ,
        2 : "Работа с файлом лога.\n",
    }

dict_options_admin_base = \
    {
        0 : "Что будешь делать дальше? Сортировка для дальнейшей обработки [1], Просмотр [2] или Блокировка контакта [3]: " ,
        1 : "Сортировка БД.\n" ,
        2 : "Просмотр БД.\n",
        3 : "Блокировка контакта.\n"
    }

dict_options_admin_log = \
    {
        0 : "Что требуется сделать с файлом? Просто посмотреть [1] или Изменить [2]: " ,
        1 : "Просмотр лога.\n" ,
        2 : "Изменение файла лога.\n",
    }

dict_options_finish = \
    {
        0 : "Вы закончили работу со списком задач? Да, завершить работу [1] или Нет, я хочу поработать еще [2]: " ,
        1 : "Завершение работы. Выход из программы.\n" ,
        2 : "Продолжаем работу.\n",
    }
